# series

In [1]:
import pandas as pd
import numpy as np

In [2]:
# creating series using dictionary


dict={'a':19,
      'b':20}
series=pd.Series(dict)

In [3]:
print(series)

a    19
b    20
dtype: int64

In [4]:
# creating a dataframe usinf dictionary
dict1={
    'Plane':['Rafale','Mig21','Sukhoi'],
    'Country':['Russia','Russia','India']
}
df=pd.DataFrame(dict1)
df

    Plane Country
0  Rafale  Russia
1   Mig21  Russia
2  Sukhoi   India

In [5]:
# creating a data frame using list of dictionary
list=[{
    'name':'Ujjwal'
    ,'Age':20,
    'Occupation':'Student'
      },
      {
    'name':'Hitesh',
    'Age':21,
    'Occupation':'Student'
           
      },
      {
    'name':'Ankush'
    ,'Age':21,
    'Occupation':'Student'
      },
      {
    'name':'samarpit',
    'Age':19,
    'Occupation':'Student'
           
      }
      ]
df1=pd.DataFrame(list)
df1

       name  Age Occupation
0    Ujjwal   20    Student
1    Hitesh   21    Student
2    Ankush   21    Student
3  samarpit   19    Student

In [15]:
# access the element of  dataframe
df1.at[1,'Age'] # what is inside the 1 row of age column
df1.iat[0,0] # it works similar to list (in iat you can only give index value to acccess element) this is used to only get the element
df1.loc[0,'name'] # Access a group of rows
df1.iloc[0,0] # it works similar to list (in iloc you can only give index value to acccess element)
df1.loc[df1['Age']>20]
df1.loc[0]
df1.loc[[0,1]]
df1.loc[1,'Age']
df1.loc[0:2,'Age']
df1.loc[1,'Age']+=5
df1

       name  Age Occupation
0    Ujjwal   35    Student
1    Hitesh   40    Student
2    Ankush   35    Student
3  samarpit   35    Student

In [20]:
df2=df1.rename(columns={

    'Age':'age'
})
df2

df2['Work']=df2['Occupation'][:3]
df2

       name  age Occupation     Work
0    Ujjwal   35    Student  Student
1    Hitesh   40    Student  Student
2    Ankush   35    Student  Student
3  samarpit   35    Student      NaN

In [7]:
df.describe()

         Plane Country
count        3       3
unique       3       2
top     Rafale  Russia
freq         1       2

In [8]:
df1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 3 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   name        4 non-null      object
 1   Age         4 non-null      int64
 2   Occupation  4 non-null      object
dtypes: int64(1), object(2)
memory usage: 228.0+ bytes